<?
@extract($_GET); 
@extract($_POST); 

// 랜덤 가중치
function weighted_random($weights) {
	$r = rand(1, array_sum($weights));
	for($i=0; $i<count($weights); $i++) {
		$r -= $weights[$i];
		if($r < 1) return $i;
	}
	return false;
}



//=====================================================================================================================
//	EVENT 01 - 룰렛이벤트
//=====================================================================================================================
// 룰렛이벤트 참여여부
if($mode == "event_01"){

	echo "Y";

}

// 룰렛이벤트 랜덤 가중치
else if($mode == "event_01_random"){
	
	$per1 = 72;		// 
	$per2 = 72;		// 
	$per3 = 72;		// 
	$per4 = 72;		// 
	$per5 = 72;		// 
	
	$values = array('1','2','3','4','5');
	$weights = array($per1,$per2,$per3,$per4,$per5,$per6,$per7,$per8);
	
	$index = weighted_random($weights);
	$result = $values[$index];
	echo $result;

}

// 룰렛이벤트 참여 등록
else if($mode == "event_01_reg"){

	
}
//=====================================================================================================================
//	EVENT 01 - 룰렛이벤트
//=====================================================================================================================
?>